deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino

#include "ActionsList.h"
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <Fonts/Org_01.h>
#include <string.h>
#include <WiFi.h>
#include <WebServer.h>
#include <WiFiClient.h>
#include <soc/sens_reg.h>
#include <soc/soc.h>
#include <ArduinoJson.h>

#ifdef __AVR_ATmega328P__ || __AVR_ATmega168__
#define ARDUINO_ARCH_UNO
#endif

#define MS_SYSTEM_VERSION "0.2"

#define FONT_BASELINE_CORRECTION_NORMAL 6
#define FONT_BASELINE_CORRECTION_LARGE 12
#define MS_FONT_TEXT_SIZE_NORMAL 1
#define MS_FONT_TEXT_SIZE_LARGE 2

const char* MS_OFF_STRING = "OFF";
const char* MS_ON_STRING = "ON";
const char* MS_BACK_BUTTON_PROMPT = "B1 - Back";
const char* MS_READING_PROMPT_TEXT = "Reading...";
const char* MS_STARTING_PROMPT_TEXT = "Starting...";

const char* MS_FAR_ACTIVE_SETTING_KEY = "far-active";
const char* MS_MID_ACTIVE_SETTING_KEY = "mid-active";
const char* MS_NEAR_ACTIVE_SETTING_KEY = "near-active";

const char* MS_FAR_WET_SETTING_KEY = "wet-far";
const char* MS_MID_WET_SETTING_KEY = "wet-mid";
const char* MS_NEAR_WET_SETTING_KEY = "wet-near";

const char* MS_FAR_DRY_SETTING_KEY = "dry-far";
const char* MS_MID_DRY_SETTING_KEY = "dry-mid";
const char* MS_NEAR_DRY_SETTING_KEY = "dry-near";

const char* MS_APV_SETTING_KEY = "apv";
const char* MS_DAPV_SETTING_KEY = "dapv";

const char* MS_PUMP_MAX_DURATION_SETTING_KEY = "p-max";
const char* MS_PUMP_REACT_INT_DURATION_SETTING_KEY = "p-react";

const char* MS_SENSOR_INTERVAL_DRY_SETTING_KEY = "s-dry";
const char* MS_SENSOR_INTERVAL_ON_SETTING_KEY = "s-on";
const char* MS_SENSOR_INTERVAL_PUMPING_SETTING_KEY = "s-pumping";

const char* MS_WIFI_TOGGLE_SETTING_KEY = "wifi";

// Mempools

DynamicJsonDocument doc1(1024);
DynamicJsonDocument doc2(1024);
DynamicJsonDocument doc3(1024);
DynamicJsonDocument doc4(1024);


unsigned char stringPool1024b1[1024];
unsigned char stringPool1024b2[1024];
unsigned char stringPool1024b3[1024];
unsigned char stringPool1024b4[1024];

char stringPool50b1[50];
char stringPool50b2[50];
char stringPool50b3[50];
char stringPool50b4[50];

char stringPool30b1[30];
char stringPool30b2[30];
char stringPool30b3[30];
char stringPool30b4[30];

char stringPool20b1[20];
char stringPool20b2[20];
char stringPool20b3[20];
char stringPool20b4[20];

char stringPool10b1[10];
char stringPool10b2[10];
char stringPool10b3[10];
char stringPool10b4[10];

char stringPool5b1[5];
char stringPool5b2[5];
char stringPool5b3[5];
char stringPool5b4[5];

// end of Mempools


#ifdef ARDUINO_ARCH_ESP32

#include <Preferences.h>
#define MS_PREFERENCES_ID "msys"

#else
#include <EEPROM.h>
#define _max max
#define _min min
#endif

#define MS_BUTTON1 1
#define MS_BUTTON2 2
#define MS_BUTTON3 3
#define MS_BUTTON4 4

#define SCREENS_COUNT 12

#define MS_HOME_SCREEN 0
#define MS_SETTINGS_SCREEN 1
#define MS_SENSOR_SETTINGS_SCREEN 2
#define MS_THRESHOLDS_SETTINGS_SCREEN 3
#define MS_INTERVALS_SETTINGS_SCREEN 4
#define MS_PUMP_INTERVALS_SETTINGS_SCREEN 5
#define MS_SENSOR_INTERVALS_SETTINGS_SCREEN 6
#define MS_PROCESSES_SCREEN 7
#define MS_MENU_SCREEN 8
#define MS_CONNECTIVITY_SETTINGS_SCREEN 9
#define MS_CONNECTIVITY_INFO_SCREEN 10
#define MS_WIFI_TOGGLE_SCREEN 11

#define SCREEN_WIDTH 128 // OLED display width, in pixels
#define SCREEN_HEIGHT 64 // OLED display height, in pixels

#define DEFAULT_TEXT_SIZE 2

#define DEFAULT_FONT Org_01

#define MS_H_CENTER 1
#define MS_H_LEFT 2
#define MS_H_RIGHT 4
#define MS_V_CENTER 8
#define MS_V_TOP 16
#define MS_V_BOTTOM 32


// Declaration for an SSD1306 display connected to I2C (SDA, SCL pins)
// The pins for I2C are defined by the Wire-library. 
// On an arduino UNO:       A4(SDA), A5(SCL)
// On an arduino MEGA 2560: 20(SDA), 21(SCL)
// On an arduino LEONARDO:   2(SDA),  3(SCL), ...
#define OLED_RESET     4 // Reset pin # (or -1 if sharing Arduino reset pin)
#define SCREEN_ADDRESS 0x3C ///< See datasheet for Address; 0x3D for 128x64, 0x3C for 128x32
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

#ifdef ARDUINO_ARCH_ESP32

#define BUTTON_1_LOW 500
#define BUTTON_1_HIGH 1700

#define BUTTON_2_LOW 2000
#define BUTTON_2_HIGH 2400

#define BUTTON_3_LOW 2900
#define BUTTON_3_HIGH 3500

#define BUTTON_4_LOW 3800
#define BUTTON_4_HIGH 4500

Preferences preferences;

#define PUMP_PIN 27
#define SENSOR_PIN 14

#define SENSOR_PIN_HIGH LOW
#define PUMP_PIN_HIGH LOW
#define SENSOR_PIN_LOW HIGH
#define PUMP_PIN_LOW HIGH

#ifdef ARDUINO_ARCH_ESP32
#define PIN_FAR 34
#define PIN_MID 35
#define PIN_NEAR 32
#endif

#ifndef ARDUINO_ARCH_ESP32
#define PIN_FAR A0
#define PIN_MID A1
#define PIN_NEAR A2
#endif

#define PIN_VALVE_FAR 33
#define PIN_VALVE_MID 25
#define PIN_VALVE_NEAR 26

#define BUTTONS_PIN 12

#endif
#ifndef ARDUINO_ARCH_ESP32

#define BUTTON_1_LOW 100
#define BUTTON_1_HIGH 280

#define BUTTON_2_LOW 300
#define BUTTON_2_HIGH 450

#define BUTTON_3_LOW 500
#define BUTTON_3_HIGH 600

#define BUTTON_4_LOW 650
#define BUTTON_4_HIGH 1024

#define PUMP_PIN 4
#define SENSOR_PIN 2

#define SENSOR_PIN_HIGH LOW
#define PUMP_PIN_HIGH LOW
#define SENSOR_PIN_LOW HIGH
#define PUMP_PIN_LOW HIGH

#define PIN_FAR A0
#define PIN_MID A1
#define PIN_NEAR A2

#define PIN_VALVE_FAR 10
#define PIN_VALVE_MID 11
#define PIN_VALVE_NEAR 12

#define BUTTONS_PIN A3

#endif

#define SENSORS_COUNT 3

#define MS_SENSOR_FAR  0
#define MS_SENSOR_MID  1
#define MS_SENSOR_NEAR  2

#define ACTIONS_COUNT 7

// action defines
#define SENSORS_ACTION 0
#define OUTLET_FAR_ACTION 1
#define OUTLET_MID_ACTION 2
#define OUTLET_NEAR_ACTION 3
#define PUMP_ACTION 4
#define DRAW_UI_ACTION 5
#define WIFI_ACTION 6


// end of action defines

//#undef DEBUG
#define DEBUG


// Structures

struct MSScreenBox {
	int x;
	int y;
	int w;
	int h;
};

enum WIFIState {
	MS_WIFI_STOPPED = 0,
	MS_WIFI_CONNECTING = 1,
	MS_WIFI_CONNECTED = 2,
	MS_WIFI_DISCONNECTED = 3,
	MS_WIFI_FAILED = 4,
	MS_WIFI_LOST = 5,
	MS_WIFI_IDLE = 6,
	MS_WIFI_NO_SSID = 7,
	MS_WIFI_NO_SHIELD = 8,
	MS_WIFI_SCAN_COMPL = 9
};

struct WiFIState {
	char* ssid = "Mirwais";
	char* password = "importantpassword";
	int state = MS_WIFI_STOPPED;
	bool isActive = false;
} wifi;

struct MSysSettings {
	unsigned long siw = 5000; // 5 seconds for sensor interval while watering
	unsigned long sid = 60000 * 1; // 1 minute for sensor interval while in stand by
	unsigned long sd = 1000; // 1 second max duration for sensor activation;
	unsigned long pi = 60000 * 10; // 10 minutes between pump activations
	unsigned long pd = 60000 * 2; // 2 minutes max pump on duration
	int apv = 50; // % humidity threshold for pump activation
	int dapv = 85; // % humidity threshold for pump deactivation
} settings;

