deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
void showTextCaptionScreen(Adafruit_SSD1306* display, const char* caption) {
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedText(&canvas, caption, MS_FONT_TEXT_SIZE_LARGE, MS_V_CENTER | MS_H_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void showActionPromptScreen(Adafruit_SSD1306* display, char* btn, char* action) {
	sprintf(stringPool20b1, "Press %s", btn);
	char* message[] = { stringPool20b1, action };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 2, DEFAULT_TEXT_SIZE, MS_H_CENTER, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawSplashScreen(Adafruit_SSD1306* display) {
	sprintf(stringPool10b1, "Version: %s", MS_SYSTEM_VERSION);
	char* texts[] = { "Irrigation", "System", stringPool10b1 };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	canvas.drawRoundRect(0, 0, SCREEN_WIDTH, SCREEN_HEIGHT, 10, SSD1306_WHITE);
	printAlignedTextStack(&canvas, texts, 3, DEFAULT_TEXT_SIZE, MS_H_CENTER, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

// end of Display


void extractMedianPinValueForProperty(int delayInterval, int* near, int* mid, int* far) {
	int farV = 0;
	int midV = 0;
	int nearV = 0;

	for (int i = 0; i < 10; i++) {
		farV += fixedAnalogRead(PIN_FAR);
		midV += fixedAnalogRead(PIN_MID);
		nearV += fixedAnalogRead(PIN_NEAR);
		if (delayInterval > 0) {
			delay(delayInterval);
		}
	}

	(*far) = (int)(farV / 10);
	(*mid) = (int)(midV / 10);
	(*near) = (int)(nearV / 10);
}

// End of Helpers

// Actions

// Outlets

// Far

void startFarOutlet(Action* a) {
	digitalWrite(PIN_VALVE_FAR, LOW);
	state.vf = true;
}

void tickFarOutlet(Action* a) {
}

void stopFarOutlet(Action* a) {
	digitalWrite(PIN_VALVE_FAR, HIGH);
	state.vf = false;
}

// end of Far

// Mid

void startMidOutlet(Action* a) {
	digitalWrite(PIN_VALVE_MID, LOW);
	state.vm = true;
}

void tickMidOutlet(Action* a) {
}

void stopMidOutlet(Action* a) {
	digitalWrite(PIN_VALVE_MID, HIGH);
	state.vm = false;
}

// end of Mid

// Near

void startNearOutlet(Action* a) {
	digitalWrite(PIN_VALVE_NEAR, LOW);
	state.vn = true;
}

void tickNearOutlet(Action* a) {
}

void stopNearOutlet(Action* a) {
	digitalWrite(PIN_VALVE_NEAR, HIGH);
	state.vn = false;
}

// end of Near
//

// wifi
WebServer server(80);

char* _resolveWiFIStatusString(char* target, int status) {
	char* message;
	switch (wifi.state) {
	case MS_WIFI_CONNECTED:
		message = "connected";
		break;
	case MS_WIFI_DISCONNECTED:
		message = "disconnected";
		break;
	case MS_WIFI_FAILED:
		message = "failed";
		break;
	case MS_WIFI_LOST:
		message = "lost";
		break;
	case MS_WIFI_IDLE:
		message = "idle";
		break;
	case MS_WIFI_NO_SSID:
		message = "no ssid";
		break;
	case MS_WIFI_SCAN_COMPL:
		message = "scan compl";
		break;
	case MS_WIFI_NO_SHIELD:
		message = "no shield";
		break;
	default:
		message = "off";
		break;
	}

	sprintf(target, "%s%s", message);
	return target;
}


void connectWiFi() {
	WiFi.mode(WIFI_STA);
	WiFi.setAutoConnect(true);
	WiFi.persistent(true);
	WiFi.setHostname("MS-System");
	WiFi.begin(wifi.ssid, wifi.password);
}
bool serverActivated = false;

void updateWiFiStatus() {
	switch (WiFi.status()) {
	case WL_CONNECTED:
		wifi.state = MS_WIFI_CONNECTED;
		break;
	case WL_DISCONNECTED:
		wifi.state = MS_WIFI_DISCONNECTED;
		break;
	case WL_CONNECT_FAILED:
		wifi.state = MS_WIFI_FAILED;
		break;
	case WL_CONNECTION_LOST:
		wifi.state = MS_WIFI_LOST;
		break;
	case WL_IDLE_STATUS:
		wifi.state = MS_WIFI_IDLE;
		break;
	case WL_NO_SSID_AVAIL:
		wifi.state = MS_WIFI_NO_SSID;
		break;
	case WL_SCAN_COMPLETED:
		wifi.state = MS_WIFI_SCAN_COMPL;
		break;
	case WL_NO_SHIELD:
		wifi.state = MS_WIFI_NO_SHIELD;
		break;
	}
}

bool _requestAuth() {
	if (!server.authenticate("ms-system-admin", "importantpassword")) {
		server.requestAuthentication();
		return false;
	}
	return true;
}

void _generateStatus(DynamicJsonDocument* doc) {
	(*doc)["status"] = "OK";

	(*doc)["thresholds"]["apv_perc"] = settings.apv;
	(*doc)["thresholds"]["dapv_perc"] = settings.dapv;

	(*doc)["pump"]["active"] = state.p;
	(*doc)["pump"]["di_sec"] = settings.pd / 1000;
	(*doc)["pump"]["offtime_sec"] = settings.pi / 1000;

	for (int i = 0; i < SENSORS_COUNT; i++) {
		Sensor* cur = &state.s[i];
		bool isActive = (*cur).active;
		(*doc)["sensors"][(*cur).name]["active"] = (*cur).active;
		(*doc)["sensors"]["di_sec"] = settings.sid / 1000;
		(*doc)["sensors"]["p_di_sec"] = settings.siw / 1000;
		(*doc)["sensors"]["ontime_sec"] = availableActions[SENSORS_ACTION].td / 1000;

		if (isActive) {
			(*doc)["sensors"][(*cur).name]["hum_perc"] = (*cur).p;
			(*doc)["sensors"][(*cur).name]["dry_val"] = (*cur).dry;
			(*doc)["sensors"][(*cur).name]["wet_val"] = (*cur).wet;
			(*doc)["sensors"][(*cur).name]["cur_val"] = (*cur).value;
		}
	}
}

void handleStatus() {
	_generateStatus(&doc1);
	serializeJson(doc1, stringPool1024b1);
	server.send(200, "application/json", (char*)stringPool1024b1);
	doc1.clear();
	memset(stringPool1024b1, 0, 1024);
}

void handleModifySetting() {
	if (_requestAuth()) {

		String body = server.arg("plain");
		body.getBytes(stringPool1024b1, 1024, 0);
		deserializeJson(doc1, stringPool1024b1);

		if (doc1.containsKey(MS_APV_SETTING_KEY)) {
			settings.apv = max(0, (int)min((int)doc1[MS_APV_SETTING_KEY], settings.dapv - 5));
		}

		if (doc1.containsKey(MS_DAPV_SETTING_KEY)) {
			settings.dapv = max(settings.apv + 5, min((int)doc1[MS_DAPV_SETTING_KEY], 100));
		}

		if (doc1.containsKey(MS_PUMP_MAX_DURATION_SETTING_KEY)) {
			settings.pd = min(5 * 60000, max((int)doc1[MS_PUMP_MAX_DURATION_SETTING_KEY], 60000));
		}

		if (doc1.containsKey(MS_PUMP_REACT_INT_DURATION_SETTING_KEY)) {
			settings.pi = min(20 * 60000, max((int)doc1[MS_PUMP_REACT_INT_DURATION_SETTING_KEY], 60000));
		}

		if (doc1.containsKey(MS_NEAR_ACTIVE_SETTING_KEY)) {
			state.s[MS_SENSOR_NEAR].active = (doc1[MS_NEAR_ACTIVE_SETTING_KEY] == true ? true : false);
		}

		if (doc1.containsKey(MS_MID_ACTIVE_SETTING_KEY)) {
			state.s[MS_SENSOR_MID].active = (doc1[MS_MID_ACTIVE_SETTING_KEY] == true ? true : false);
		}

		if (doc1.containsKey(MS_FAR_ACTIVE_SETTING_KEY)) {
			state.s[MS_SENSOR_FAR].active = (doc1[MS_FAR_ACTIVE_SETTING_KEY] == true ? true : false);
		}

		_generateStatus(&doc2);
		serializeJson(doc2, stringPool1024b2);
		server.send(200, "application/json", (char*)stringPool1024b2);

