deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
		doc1.clear();
		doc2.clear();
		memset(stringPool1024b1, 0, 1024);
		memset(stringPool1024b2, 0, 1024);

		storeSetPreferences();
	}
}

void handleCommandRestart() {
	if (_requestAuth()) {
		server.send(200, "text/plain", "Restaring...");
		delay(2000);
#ifdef ARDUINO_ARCH_ESP32
		ESP.restart();
#endif
	}
}




void setupWebServer() {
	server.on("/api/status", HTTP_GET, &handleStatus);
	server.on("/api/modify/setting", HTTP_POST, &handleModifySetting);
	server.on("/api/command/restart", HTTP_POST, &handleCommandRestart);
	server.onNotFound([]() {server.send(404, "text/plain", "Sorry ;)"); });
	server.begin();
}

void startWifi(Action* a) {
	connectWiFi();
	setupWebServer();
}

void tickWifi(Action* a) {
	updateWiFiStatus();

	if (wifi.state == MS_WIFI_IDLE) {
		WiFi.reconnect();
	}

	server.handleClient();
}

void stopWifi(Action* a) {
	server.stop();
	WiFi.disconnect();
	WiFi.mode(WIFI_OFF);
	wifi.state = MS_WIFI_STOPPED;
}

// end of wifi

// Sensors

void startSensors(Action* a) {
	digitalWrite(SENSOR_PIN, SENSOR_PIN_HIGH);
	state.sa = true;
}

void stopSensors(Action* a) {
	digitalWrite(SENSOR_PIN, SENSOR_PIN_LOW);
	state.sa = false;
}

void tickSensors(Action* a) {

	extractMedianPinValueForProperty(0, &state.s[MS_SENSOR_NEAR].value, &state.s[MS_SENSOR_MID].value, &state.s[MS_SENSOR_FAR].value);

	bool activate = false;
	Action** acandidates = (Action**)malloc(sizeof(Action*) * SENSORS_COUNT);
	int pc = 0;
	int ac = 0;
	for (int i = 0; i < SENSORS_COUNT; i++) {
		Sensor* se = &state.s[i];
		Action* ca = &availableActions[(*se).ai];
		float v = (float)(*se).value;
		float d = (float)(*se).dry;
		float w = (float)(*se).wet;
		float dwd = _max(0.00001, d - w);

		float mp = ((d - _min(_max(v, w), d)) / dwd) * 100.0;
		(*se).p = (int)mp;

		activate = (*se).active && (bool)((long)mp < (state.p ? settings.dapv : settings.apv));

		acandidates[i] = nullptr;
		if (activate && ca != nullptr) {
			ac++;
			if ((*ca).state == MS_NON_ACTIVE) {
				acandidates[i] = ca;
				pc++;
			}
			else if ((*ca).state == MS_PENDING) {
				requestStop(&executionList, ca);
			}
		}
		else if (ca != nullptr) {
			// Stop the action for which activate is false
			requestStop(&executionList, ca);
		}
	}

	// if the available outlets are equal to the 
	// ones needed to be activated - we select the 
	// one that was activated the earliest
	if (pc > 0 && pc == ac) {

		Action* ts = nullptr;
		for (int i = 0; i < SENSORS_COUNT; i++) {
			Action* c = acandidates[i];

			if (c != nullptr) {
				if (ts != nullptr) {
					if ((*c).st < (*ts).st) {
						ts = c;
					}
				}
				else {
					ts = c;
				}
			}
		}

		if (ts != nullptr) {
			scheduleAction(&executionList, ts);
		}
	}

	(*a).ti = availableActions[PUMP_ACTION].state == MS_CHILD_RUNNING ? settings.siw : settings.sid;
	free(acandidates);
}

//end of sensors

// Display

const char* _hsResolveSensorInfo(char* target, Sensor* s) {
	if ((*s).active) {
		sprintf(target, "%d%%", (*s).p);
	}
	else {
		return MS_OFF_STRING;
	}
	return target;
}

void drawHomeScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	sprintf(stringPool30b1, "PA: %d%% PD: %d%%", settings.apv, settings.dapv);
	sprintf(stringPool30b2, "N: %s M: %s F: %s", _hsResolveSensorInfo(stringPool5b1, &state.s[MS_SENSOR_NEAR]), _hsResolveSensorInfo(stringPool5b2, &state.s[MS_SENSOR_MID]), _hsResolveSensorInfo(stringPool5b3, &state.s[MS_SENSOR_FAR]));
	sprintf(stringPool30b3, "VN: %s VM: %s VF: %s", state.vn ? MS_ON_STRING : MS_OFF_STRING, state.vm ? MS_ON_STRING : MS_OFF_STRING, state.vf ? MS_ON_STRING : MS_OFF_STRING);
	sprintf(stringPool30b4, "PUMP: %s SENSORS: %s", state.p ? MS_ON_STRING : MS_OFF_STRING, state.sa ? MS_ON_STRING : MS_OFF_STRING);
	sprintf(stringPool20b1, "WIFI: %s", _resolveWiFIStatusString(stringPool20b2, wifi.state));
	char* message[] = { stringPool30b1, stringPool30b2, stringPool30b3, stringPool30b4, stringPool20b1 };
	printAlignedTextStack(&mainCanvas, message, 5, 1, MS_H_CENTER, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, "B1 - menu", 1, (MS_H_CENTER | MS_V_BOTTOM));
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleHomeScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_MENU_SCREEN;
	}
}

void drawThresholdsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	sprintf(stringPool20b1, "APV: %d%%", settings.apv);
	sprintf(stringPool20b2, "DAPV: %d%%", settings.dapv);
	char* message[] = { stringPool20b1, stringPool20b2 };
	printAlignedTextStack(&mainCanvas, message, 2, MS_FONT_TEXT_SIZE_LARGE, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);

	printAlignedText(&mainCanvas, "B1 - Back, B2-B3 - edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleThresholdsSettingsScreen(int buttonValue) {

	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		int upperLimit = settings.dapv - 5;
		int nv = _min((settings.apv + 5) % settings.dapv, upperLimit);
		settings.apv = nv;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		int nv = _max(_min((settings.dapv + 5) % 105, 100), settings.apv + 5);
		settings.dapv = nv;

	}

	storeSetPreferences();
}

void drawSensorSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	int circleRadius = 17;
	int spacing = 3;
	int boxWidth = 2 * spacing + 3 * (circleRadius * 2);
	int boxX = SCREEN_WIDTH / 2 - boxWidth / 2 + circleRadius;
	int boxY = circleRadius;

	for (int i = 0; i < SENSORS_COUNT; i++) {
		Sensor* s = &state.s[i];
		bool isActive = (*s).active;
		if ((*s).active) {
			mainCanvas.fillCircle(boxX, boxY, circleRadius, SSD1306_WHITE);
		}
		else {

