deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
			mainCanvas.drawCircle(boxX, boxY, circleRadius, SSD1306_WHITE);
		}
		int16_t x, y;
		uint16_t w, h;
		sprintf(stringPool10b1, "%d%%", (*s).p);
		mainCanvas.getTextBounds(isActive ? stringPool10b1 : MS_OFF_STRING, 0, 0, &x, &y, &w, &h);
		mainCanvas.setCursor(boxX - w / 2 + w % 2, boxY - h / 2 + h % 2 + FONT_BASELINE_CORRECTION_NORMAL / 2);
		mainCanvas.setTextColor(isActive ? SSD1306_BLACK : SSD1306_WHITE);
		mainCanvas.setTextSize(MS_FONT_TEXT_SIZE_NORMAL);

		if (isActive) {
			mainCanvas.print(stringPool10b1);
		}
		else {
			mainCanvas.print(MS_OFF_STRING);
		}

		mainCanvas.getTextBounds((*s).name, 0, 0, &x, &y, &w, &h);
		mainCanvas.setTextColor(SSD1306_WHITE);
		printPositionedText(&mainCanvas, (*s).name, boxX - w / 2, boxY + circleRadius + spacing + FONT_BASELINE_CORRECTION_NORMAL);

		boxX += circleRadius * 2 + spacing;
	}

	printAlignedText(&mainCanvas, "B1 - Back, B2-B4 - edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleSensorSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		bool isActive = state.s[MS_SENSOR_FAR].active = !state.s[MS_SENSOR_FAR].active;
		if (!isActive) {
			availableActions[OUTLET_MID_ACTION].lst = 0;
			availableActions[OUTLET_MID_ACTION].st = 0;
		}
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		bool isActive = state.s[MS_SENSOR_MID].active = !state.s[MS_SENSOR_MID].active;
		if (!isActive) {
			availableActions[OUTLET_MID_ACTION].lst = 0;
			availableActions[OUTLET_MID_ACTION].st = 0;
		}
	}
	else if (buttonValue > BUTTON_4_LOW && buttonValue < BUTTON_4_HIGH) {
		bool isActive = state.s[MS_SENSOR_NEAR].active = !state.s[MS_SENSOR_NEAR].active;
		if (!isActive) {
			availableActions[OUTLET_NEAR_ACTION].lst = 0;
			availableActions[OUTLET_NEAR_ACTION].st = 0;
		}

	}

	storeSetPreferences();
}

void drawWIFIToggleScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	const char* wifiCaption = "WIFI";
	int circleRadius = 17;
	int spacing = 3;
	int boxWidth = 2 * spacing + (circleRadius * 2);
	int boxX = SCREEN_WIDTH / 2 - boxWidth / 2 + circleRadius;
	int boxY = circleRadius;

	bool isActive = availableActions[WIFI_ACTION].state == MS_RUNNING ? true : false;
	if (isActive) {
		mainCanvas.fillCircle(boxX, boxY, circleRadius, SSD1306_WHITE);
	}
	else {
		mainCanvas.drawCircle(boxX, boxY, circleRadius, SSD1306_WHITE);
	}
	int16_t x, y;
	uint16_t w, h;
	sprintf(stringPool10b1, "%s", isActive ? "on" : "off");
	mainCanvas.getTextBounds(stringPool10b1, 0, 0, &x, &y, &w, &h);
	mainCanvas.setCursor(boxX - w / 2 + w % 2, boxY - h / 2 + h % 2 + FONT_BASELINE_CORRECTION_NORMAL / 2);
	mainCanvas.setTextColor(isActive ? SSD1306_BLACK : SSD1306_WHITE);
	mainCanvas.setTextSize(MS_FONT_TEXT_SIZE_NORMAL);
	mainCanvas.print(stringPool10b1);
	mainCanvas.getTextBounds(wifiCaption, 0, 0, &x, &y, &w, &h);
	mainCanvas.setTextColor(SSD1306_WHITE);
	printPositionedText(&mainCanvas, wifiCaption, boxX - w / 2, boxY + circleRadius + spacing + FONT_BASELINE_CORRECTION_NORMAL);

	boxX += circleRadius * 2 + spacing;

	printAlignedText(&mainCanvas, "B1 - Back, B3 - toggle", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleWIFIToggleScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_CONNECTIVITY_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		if (availableActions[WIFI_ACTION].state == MS_RUNNING) {
			requestStop(&executionList, &availableActions[WIFI_ACTION]);
			wifi.isActive = false;
		}
		else if (availableActions[WIFI_ACTION].state == MS_NON_ACTIVE) {
			scheduleAction(&executionList, &availableActions[WIFI_ACTION]);
			wifi.isActive = true;
		}
	}

	storeSetPreferences();
}

void drawConnectivityInfoScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	if (wifi.state != MS_WIFI_STOPPED) {
		String ip = WiFi.localIP().toString();
		ip.getBytes((unsigned char*)stringPool20b4, 20, 0);
		sprintf(stringPool20b1, "IP: %s", stringPool20b4);
		sprintf(stringPool20b2, "SSID: %s", WiFi.SSID());
		sprintf(stringPool20b3, "Host: %s", WiFi.getHostname());
		char* text[] = { stringPool20b1, stringPool20b2, stringPool20b3 };
		printAlignedTextStack(&mainCanvas, text, 3, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	}
	else {
		printAlignedText(&mainCanvas, "WIFI: OFF", MS_FONT_TEXT_SIZE_LARGE, MS_H_CENTER | MS_V_CENTER);
	}
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleConnectivityInfoScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_CONNECTIVITY_SETTINGS_SCREEN;
	}
}

void drawConnectivitySettingsScreen(Action* a) {

	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char* text[] = { "B2 - WiFi On/Off", "B3 - Network info" };
	printAlignedTextStack(&mainCanvas, text, 2, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleConnectivitySettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_MENU_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		state.scr = MS_WIFI_TOGGLE_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		state.scr = MS_CONNECTIVITY_INFO_SCREEN;
	}
}

