deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
void drawMenuScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char* text[] = { "B2 - Settings", "B3 - Processes", "B4 - Connectivity" };
	printAlignedTextStack(&mainCanvas, text, 3, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleMenuScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_HOME_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		state.scr = MS_PROCESSES_SCREEN;
	}
	else if (buttonValue > BUTTON_4_LOW && buttonValue < BUTTON_4_HIGH) {
		state.scr = MS_CONNECTIVITY_SETTINGS_SCREEN;
	}
}


char** running = (char**)calloc(sizeof(char*), ACTIONS_COUNT);
char** stopped = (char**)calloc(sizeof(char*), ACTIONS_COUNT);
char** pending = (char**)calloc(sizeof(char*), ACTIONS_COUNT);
char** scheduled = (char**)calloc(sizeof(char*), ACTIONS_COUNT);

void drawProcessesScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);

	int stoppedCount = 0;
	int pendingCount = 0;
	int scheduledCount = 0;
	int runningCount = 0;

	pending[pendingCount++] = "P: ";
	scheduled[scheduledCount++] = "SC: ";
	running[runningCount++] = "R: ";
	stopped[stoppedCount++] = "S: ";

	for (int i = 0; i < ACTIONS_COUNT; i++) {
		Action* current = &availableActions[i];
		switch ((*current).state) {
		case MS_PENDING:
		case MS_CHILD_PENDING:
			pending[pendingCount++] = (*current).name;
			break;
		case MS_SCHEDULED:
			scheduled[scheduledCount++] = (*current).name;
			break;
		case MS_RUNNING:
		case MS_CHILD_RUNNING:
			running[runningCount++] = (*current).name;
			break;
		case MS_NON_ACTIVE:
			stopped[stoppedCount++] = (*current).name;
			break;
		}
	}
	joinStrings(pending, pendingCount, ", ", stringPool50b1, 1);
	joinStrings(stopped, stoppedCount, ", ", stringPool50b2, 1);
	joinStrings(scheduled, scheduledCount, ", ", stringPool50b3, 1);
	joinStrings(running, runningCount, ", ", stringPool50b4, 1);

	char* message[] = { stringPool50b1, stringPool50b2, stringPool50b3, stringPool50b4 };

	printAlignedTextStack(&mainCanvas, message, 4, MS_FONT_TEXT_SIZE_NORMAL, MS_H_LEFT, MS_H_LEFT | MS_V_TOP);

	memset(stringPool50b1, 0, pendingCount);
	memset(stringPool50b2, 0, stoppedCount);
	memset(stringPool50b3, 0, scheduledCount);
	memset(stringPool50b4, 0, runningCount);

	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleProcessesScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_MENU_SCREEN;
	}
}

void drawSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char* text[] = { "B2 - Intervals", "B3 - Sensors", "B4 - Thresholds" };
	printAlignedTextStack(&mainCanvas, text, 3, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_MENU_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		state.scr = MS_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		state.scr = MS_SENSOR_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_4_LOW && buttonValue < BUTTON_4_HIGH) {
		state.scr = MS_THRESHOLDS_SETTINGS_SCREEN;
	}
}

void drawSensorIntervalsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);

	sprintf(stringPool20b1, "Pump off: %d s", settings.sid / 1000);
	sprintf(stringPool20b2, "Pump on: %d s", settings.siw / 1000);
	sprintf(stringPool20b3, "ON duration: %d s", availableActions[SENSORS_ACTION].td / 1000);
	char* message[] = { stringPool20b1, stringPool20b2, stringPool20b3 };
	printAlignedTextStack(&mainCanvas, message, 3, MS_FONT_TEXT_SIZE_NORMAL, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);

	printAlignedText(&mainCanvas, "B1 - Back, B2-B4 - Edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleSensorIntervalsSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		int step = 10000;
		int upperLimit = 5 * 6 * step;
		int nv = _max((settings.sid + step) % (upperLimit + step), step);
		settings.sid = nv;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		int step = 5000;
		int upperLimit = 6 * step;
		int nv = _max((settings.siw + step) % (upperLimit + step), step);
		settings.siw = nv;
	}
	else if (buttonValue > BUTTON_4_LOW && buttonValue < BUTTON_4_HIGH) {
		int step = 1000;
		int upperLimit = 15 * step;
		unsigned long* td = &availableActions[SENSORS_ACTION].td;
		int nv = _max(((*td) + step) % (upperLimit + step), step);
		(*td) = nv;
	}

	storeSetPreferences();
}

void drawPumpIntervalsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	sprintf(stringPool20b1, "max(T): %d min", settings.pd / 60000);
	sprintf(stringPool20b2, "Re-act in: %d min", settings.pi / 60000);
	char* message[] = { stringPool20b1, stringPool20b2 };
	printAlignedTextStack(&mainCanvas, message, 2, MS_FONT_TEXT_SIZE_NORMAL, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);

	printAlignedText(&mainCanvas, "B1 - Back, B2-B3 - edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handlePumpIntervalsSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		int minute = 60000;
		int upperLimit = 5 * minute;
		int nv = _max((settings.pd + minute) % (upperLimit + minute), minute);
		settings.pd = nv;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		int minute = 60000;
		int upperLimit = 20 * minute;
		int nv = _max((settings.pi + minute) % (upperLimit + minute), minute);
		settings.pi = nv;
	}


	storeSetPreferences();
}

void drawIntervalsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char* text[] = { "B2 - Pump intervals", "B3 - Sensor intervals" };
	printAlignedTextStack(&mainCanvas, text, 2, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

