deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
void handleIntervalsSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		state.scr = MS_PUMP_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		state.scr = MS_SENSOR_INTERVALS_SETTINGS_SCREEN;
	}
}

void startBuildScreen(Action* a) {
	int newValue = readButton();
	if (newValue != button.value) {
		button.hasChanged = true;
	}

	button.value = newValue;
	display.clearDisplay();
}

void tickBuildScreen(Action* a) {
	int screenIndex = state.scr;
	if (screenIndex < SCREENS_COUNT) {
		MSScreen* current = (MSScreen*)&availableScreens[screenIndex];
		(*current).drawUI(a);
		if (button.hasChanged) {
			(*current).handleButtons(button.value);
			button.hasChanged = false;
		}
	}
}

void stopBuildScreen(Action* a) {
	button.hasChanged = false;
	button.value = 0;
}

// end of Display

// Pump
void startPump(Action* a) {
	digitalWrite(PUMP_PIN, PUMP_PIN_HIGH);
	state.p = true;
}

void stopPump(Action* a) {
	digitalWrite(PUMP_PIN, PUMP_PIN_LOW);
	state.p = false;
}

void tickPump(Action* a) {
}

//end of pump

// end of Actions


void populateScreens() {
	availableScreens[MS_HOME_SCREEN].drawUI = &drawHomeScreen;
	availableScreens[MS_HOME_SCREEN].handleButtons = &handleHomeScreen;

	availableScreens[MS_SETTINGS_SCREEN].drawUI = &drawSettingsScreen;
	availableScreens[MS_SETTINGS_SCREEN].handleButtons = &handleSettingsScreen;

	availableScreens[MS_SENSOR_SETTINGS_SCREEN].drawUI = &drawSensorSettingsScreen;
	availableScreens[MS_SENSOR_SETTINGS_SCREEN].handleButtons = &handleSensorSettingsScreen;

	availableScreens[MS_THRESHOLDS_SETTINGS_SCREEN].drawUI = &drawThresholdsSettingsScreen;
	availableScreens[MS_THRESHOLDS_SETTINGS_SCREEN].handleButtons = &handleThresholdsSettingsScreen;

	availableScreens[MS_INTERVALS_SETTINGS_SCREEN].drawUI = &drawIntervalsSettingsScreen;
	availableScreens[MS_INTERVALS_SETTINGS_SCREEN].handleButtons = &handleIntervalsSettingsScreen;

	availableScreens[MS_PUMP_INTERVALS_SETTINGS_SCREEN].drawUI = &drawPumpIntervalsSettingsScreen;
	availableScreens[MS_PUMP_INTERVALS_SETTINGS_SCREEN].handleButtons = &handlePumpIntervalsSettingsScreen;

	availableScreens[MS_SENSOR_INTERVALS_SETTINGS_SCREEN].drawUI = &drawSensorIntervalsSettingsScreen;
	availableScreens[MS_SENSOR_INTERVALS_SETTINGS_SCREEN].handleButtons = &handleSensorIntervalsSettingsScreen;

	availableScreens[MS_PROCESSES_SCREEN].drawUI = &drawProcessesScreen;
	availableScreens[MS_PROCESSES_SCREEN].handleButtons = &handleProcessesScreen;

	availableScreens[MS_MENU_SCREEN].drawUI = &drawMenuScreen;
	availableScreens[MS_MENU_SCREEN].handleButtons = &handleMenuScreen;

	availableScreens[MS_CONNECTIVITY_SETTINGS_SCREEN].drawUI = &drawConnectivitySettingsScreen;
	availableScreens[MS_CONNECTIVITY_SETTINGS_SCREEN].handleButtons = &handleConnectivitySettingsScreen;

	availableScreens[MS_CONNECTIVITY_INFO_SCREEN].drawUI = &drawConnectivityInfoScreen;
	availableScreens[MS_CONNECTIVITY_INFO_SCREEN].handleButtons = &handleConnectivityInfoScreen;

	availableScreens[MS_WIFI_TOGGLE_SCREEN].drawUI = &drawWIFIToggleScreen;
	availableScreens[MS_WIFI_TOGGLE_SCREEN].handleButtons = &handleWIFIToggleScreen;
}

void populateActions() {


	// wifi action
	availableActions[WIFI_ACTION].tick = &tickWifi;
	availableActions[WIFI_ACTION].frozen = false; // when stopped the action will be removed from the list
	availableActions[WIFI_ACTION].stopRequested = false;
	availableActions[WIFI_ACTION].start = &startWifi;
	availableActions[WIFI_ACTION].stop = &stopWifi;
	availableActions[WIFI_ACTION].ti = 1;
	availableActions[WIFI_ACTION].td = 0; // duration of 0 means we never stop
	availableActions[WIFI_ACTION].to = 0;
	availableActions[WIFI_ACTION].clear = false;
	availableActions[WIFI_ACTION].state = MS_NON_ACTIVE;
	availableActions[WIFI_ACTION].child = nullptr;
	availableActions[WIFI_ACTION].lst = 0;
	availableActions[WIFI_ACTION].st = 0;
	availableActions[WIFI_ACTION].name = "wifi";

	// read sensors action
	availableActions[SENSORS_ACTION].tick = &tickSensors;
	availableActions[SENSORS_ACTION].frozen = true;
	availableActions[SENSORS_ACTION].stopRequested = false;
	availableActions[SENSORS_ACTION].start = &startSensors;
	availableActions[SENSORS_ACTION].stop = &stopSensors;
	availableActions[SENSORS_ACTION].ti = settings.siw;
	availableActions[SENSORS_ACTION].td = settings.sd;
	availableActions[SENSORS_ACTION].to = 200;
	availableActions[SENSORS_ACTION].clear = false;
	availableActions[SENSORS_ACTION].state = MS_NON_ACTIVE;
	availableActions[SENSORS_ACTION].child = nullptr;
	availableActions[SENSORS_ACTION].lst = 0;
	availableActions[SENSORS_ACTION].st = 0;
	availableActions[SENSORS_ACTION].name = "sensors";

	// open far valve action
	availableActions[OUTLET_FAR_ACTION].tick = &tickFarOutlet;
	availableActions[OUTLET_FAR_ACTION].frozen = false;
	availableActions[OUTLET_FAR_ACTION].stopRequested = false;
	availableActions[OUTLET_FAR_ACTION].start = &startFarOutlet;
	availableActions[OUTLET_FAR_ACTION].stop = &stopFarOutlet;
	availableActions[OUTLET_FAR_ACTION].ti = settings.pi;
	availableActions[OUTLET_FAR_ACTION].td = settings.pd;
	availableActions[OUTLET_FAR_ACTION].clear = false;
	availableActions[OUTLET_FAR_ACTION].to = 0;
	availableActions[OUTLET_FAR_ACTION].state = MS_NON_ACTIVE;
	availableActions[OUTLET_FAR_ACTION].child = &availableActions[PUMP_ACTION];
	availableActions[OUTLET_FAR_ACTION].lst = 0;
	availableActions[OUTLET_FAR_ACTION].st = 0;
	availableActions[OUTLET_FAR_ACTION].name = "valve-far";


	state.s[MS_SENSOR_FAR].ai = OUTLET_FAR_ACTION;

	// open mid valve action
	availableActions[OUTLET_MID_ACTION].tick = &tickMidOutlet;
	availableActions[OUTLET_MID_ACTION].frozen = false;
	availableActions[OUTLET_MID_ACTION].stopRequested = false;
	availableActions[OUTLET_MID_ACTION].start = &startMidOutlet;
	availableActions[OUTLET_MID_ACTION].stop = &stopMidOutlet;
	availableActions[OUTLET_MID_ACTION].ti = settings.pi;
	availableActions[OUTLET_MID_ACTION].td = settings.pd;
	availableActions[OUTLET_MID_ACTION].clear = false;
	availableActions[OUTLET_MID_ACTION].to = 0;
	availableActions[OUTLET_MID_ACTION].state = MS_NON_ACTIVE;
	availableActions[OUTLET_MID_ACTION].child = &availableActions[PUMP_ACTION];
	availableActions[OUTLET_MID_ACTION].lst = 0;
	availableActions[OUTLET_MID_ACTION].st = 0;
	availableActions[OUTLET_MID_ACTION].name = "valve-mid";

	state.s[MS_SENSOR_MID].ai = OUTLET_MID_ACTION;

	// open near valve action
	availableActions[OUTLET_NEAR_ACTION].tick = &tickNearOutlet;
	availableActions[OUTLET_NEAR_ACTION].frozen = false;
	availableActions[OUTLET_NEAR_ACTION].stopRequested = false;
	availableActions[OUTLET_NEAR_ACTION].start = &startNearOutlet;
	availableActions[OUTLET_NEAR_ACTION].stop = &stopNearOutlet;
	availableActions[OUTLET_NEAR_ACTION].ti = settings.pi;
	availableActions[OUTLET_NEAR_ACTION].td = settings.pd;
	availableActions[OUTLET_NEAR_ACTION].clear = false;
	availableActions[OUTLET_NEAR_ACTION].to = 0;
	availableActions[OUTLET_NEAR_ACTION].state = MS_NON_ACTIVE;
	availableActions[OUTLET_NEAR_ACTION].child = &availableActions[PUMP_ACTION];
	availableActions[OUTLET_NEAR_ACTION].lst = 0;
	availableActions[OUTLET_NEAR_ACTION].st = 0;
	availableActions[OUTLET_NEAR_ACTION].name = "valve-near";

	state.s[MS_SENSOR_NEAR].ai = OUTLET_NEAR_ACTION;

