deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
	// start pump action
	availableActions[PUMP_ACTION].tick = &tickPump;
	availableActions[PUMP_ACTION].frozen = false;
	availableActions[PUMP_ACTION].stopRequested = false;
	availableActions[PUMP_ACTION].start = &startPump;
	availableActions[PUMP_ACTION].stop = &stopPump;
	availableActions[PUMP_ACTION].ti = 0;
	availableActions[PUMP_ACTION].td = 0;
	availableActions[PUMP_ACTION].clear = false;
	availableActions[PUMP_ACTION].to = 0;
	availableActions[PUMP_ACTION].state = MS_NON_ACTIVE;
	availableActions[PUMP_ACTION].child = nullptr;
	availableActions[PUMP_ACTION].lst = 0;
	availableActions[PUMP_ACTION].st = 0;
	availableActions[PUMP_ACTION].name = "pump";


	// draw home action
	availableActions[DRAW_UI_ACTION].tick = &tickBuildScreen;
	availableActions[DRAW_UI_ACTION].frozen = true;
	availableActions[DRAW_UI_ACTION].stopRequested = false;
	availableActions[DRAW_UI_ACTION].start = &startBuildScreen;
	availableActions[DRAW_UI_ACTION].stop = &stopBuildScreen;
	availableActions[DRAW_UI_ACTION].ti = 1000;
	availableActions[DRAW_UI_ACTION].td = 100;
	availableActions[DRAW_UI_ACTION].clear = false;
	availableActions[DRAW_UI_ACTION].to = 0;
	availableActions[DRAW_UI_ACTION].state = MS_NON_ACTIVE;
	availableActions[DRAW_UI_ACTION].child = nullptr;
	availableActions[DRAW_UI_ACTION].lst = 0;
	availableActions[DRAW_UI_ACTION].st = 0;
	availableActions[DRAW_UI_ACTION].name = "ui";
}

int readButton() {
	return fixedAnalogRead(BUTTONS_PIN);
}

void storeSetPreferences() {
	preferences.begin(MS_PREFERENCES_ID, false);

	preferences.putBool(MS_FAR_ACTIVE_SETTING_KEY, state.s[MS_SENSOR_FAR].active);
	preferences.putBool(MS_MID_ACTIVE_SETTING_KEY, state.s[MS_SENSOR_MID].active);
	preferences.putBool(MS_NEAR_ACTIVE_SETTING_KEY, state.s[MS_SENSOR_NEAR].active);

	preferences.putInt(MS_APV_SETTING_KEY, settings.apv);
	preferences.putInt(MS_DAPV_SETTING_KEY, settings.dapv);

	preferences.putBool(MS_WIFI_TOGGLE_SETTING_KEY, wifi.isActive);

	preferences.putULong(MS_SENSOR_INTERVAL_PUMPING_SETTING_KEY, settings.siw);
	preferences.putULong(MS_SENSOR_INTERVAL_DRY_SETTING_KEY, settings.sid);
	preferences.putULong(MS_SENSOR_INTERVAL_ON_SETTING_KEY, availableActions[SENSORS_ACTION].td);

	preferences.putULong(MS_PUMP_MAX_DURATION_SETTING_KEY, settings.pd);
	preferences.putULong(MS_PUMP_REACT_INT_DURATION_SETTING_KEY, settings.pi);

	preferences.end();
}

void readStoredPreferences() {
	preferences.begin(MS_PREFERENCES_ID, false);

	state.s[MS_SENSOR_NEAR].dry = preferences.getInt(MS_NEAR_DRY_SETTING_KEY);
	state.s[MS_SENSOR_MID].dry = preferences.getInt(MS_MID_DRY_SETTING_KEY);
	state.s[MS_SENSOR_FAR].dry = preferences.getInt(MS_FAR_DRY_SETTING_KEY);

	state.s[MS_SENSOR_NEAR].wet = preferences.getInt(MS_NEAR_WET_SETTING_KEY);
	state.s[MS_SENSOR_MID].wet = preferences.getInt(MS_MID_WET_SETTING_KEY);
	state.s[MS_SENSOR_FAR].wet = preferences.getInt(MS_FAR_WET_SETTING_KEY);

	state.s[MS_SENSOR_NEAR].active = preferences.getBool(MS_NEAR_ACTIVE_SETTING_KEY, true);
	state.s[MS_SENSOR_MID].active = preferences.getBool(MS_MID_ACTIVE_SETTING_KEY, true);
	state.s[MS_SENSOR_FAR].active = preferences.getBool(MS_FAR_ACTIVE_SETTING_KEY, true);

	settings.apv = preferences.getInt(MS_APV_SETTING_KEY, settings.apv);
	settings.dapv = preferences.getInt(MS_DAPV_SETTING_KEY, settings.dapv);

	settings.pd = preferences.getULong(MS_PUMP_MAX_DURATION_SETTING_KEY, settings.pd);
	settings.pi = preferences.getULong(MS_PUMP_REACT_INT_DURATION_SETTING_KEY, settings.pi);

	settings.sid = preferences.getULong(MS_SENSOR_INTERVAL_DRY_SETTING_KEY, settings.sid);
	settings.siw = preferences.getULong(MS_SENSOR_INTERVAL_PUMPING_SETTING_KEY, settings.siw);
	settings.sd = preferences.getULong(MS_SENSOR_INTERVAL_ON_SETTING_KEY, settings.sd);
	wifi.isActive = preferences.getBool(MS_WIFI_TOGGLE_SETTING_KEY, wifi.isActive);

	availableActions[OUTLET_NEAR_ACTION].ti = settings.pi;
	availableActions[OUTLET_NEAR_ACTION].td = settings.pd;

	availableActions[OUTLET_MID_ACTION].ti = settings.pi;
	availableActions[OUTLET_MID_ACTION].td = settings.pd;

	availableActions[OUTLET_FAR_ACTION].ti = settings.pi;
	availableActions[OUTLET_FAR_ACTION].td = settings.pd;

	availableActions[SENSORS_ACTION].ti = settings.siw;
	availableActions[SENSORS_ACTION].td = settings.sd;

	preferences.end();
}

void setupInitialState() {
	if (availableActions != nullptr) {
		// init the Actions library
		initActionsList();

		// populate the available screens
		populateScreens();

		// populate the available actions
		populateActions();

		// set initial screen to draw
		state.scr = MS_HOME_SCREEN;

		// schedule sensors and UI actions
		scheduleAction(&executionList, &availableActions[SENSORS_ACTION]);
		scheduleAction(&executionList, &availableActions[DRAW_UI_ACTION]);
		if (wifi.isActive) {
			scheduleAction(&executionList, &availableActions[WIFI_ACTION]);
		}
	}
	else {
#ifdef DEBUG
		Serial.println(F("MEM: Actions"));
#endif
	}
}

void initActionsList() {
	executionList.availableActions = availableActions;
	executionList.availableActionsCount = ACTIONS_COUNT;
}

void allocateMemPools() {
	availableScreens = (MSScreen*)calloc(SCREENS_COUNT, sizeof(MSScreen));
	availableActions = (Action*)calloc(ACTIONS_COUNT, sizeof(Action));
	state.s = (Sensor*)calloc(SENSORS_COUNT, sizeof(Sensor));
}

void initDisplay(Adafruit_SSD1306* display) {
	if (!(*display).begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS)) {
		Serial.println(F("SSD1306 failed"));
		for (;;); // Don't proceed, loop forever
	}
	(*display).clearDisplay();
}

void ms_init() {
	// init must be made with completely dry state values

	initDisplay(&display);
	drawSplashScreen(&display);
	delay(5000);


	bool init = false;
	int seconds = 20;
	while (true) {
		drawStartingPromptScreen(&display, seconds);
		delay(1000);
		if (seconds-- == 0) {
			break;
		}
		int bs = readButton();

		if (bs > BUTTON_1_LOW && bs < BUTTON_1_HIGH) {
			init = true;
			break;
		}
		else if (bs > BUTTON_2_LOW && bs < BUTTON_2_HIGH) {
			init = false;
			break;
		}
	}

	sprintf(state.s[MS_SENSOR_NEAR].name, "near");
	sprintf(state.s[MS_SENSOR_MID].name, "mid");
	sprintf(state.s[MS_SENSOR_FAR].name, "far");
	// we start with stored values normally
	if (!init) {

#ifdef ARDUINO_ARCH_ESP32
		readStoredPreferences();

#else
		int nd = 0, md = 0, fd = 0, nw = 0, mw = 0, fw = 0;
		EEPROM.get(0, nd);
		EEPROM.get(sizeof(int), md);
		EEPROM.get(sizeof(int) * 2, fd);
		EEPROM.get(sizeof(int) * 3, nw);
		EEPROM.get(sizeof(int) * 4, mw);
		EEPROM.get(sizeof(int) * 5, fw);
		state.s[MS_SENSOR_NEAR].dry = nd;
		state.s[MS_SENSOR_MID].dry = md;
		state.s[MS_SENSOR_FAR].dry = fd;

		state.s[MS_SENSOR_NEAR].wet = nw;
		state.s[MS_SENSOR_MID].wet = mw;
		state.s[MS_SENSOR_FAR].wet = fw;
#endif
		showTextCaptionScreen(&display, MS_STARTING_PROMPT_TEXT);
		// drawStartingValuesScreen(&display);
		delay(2000);
	}
	else {
		digitalWrite(SENSOR_PIN, SENSOR_PIN_HIGH);
#ifdef ARDUINO_ARCH_ESP32
		preferences.begin(MS_PREFERENCES_ID, false);
		preferences.clear();
#else
		for (int i = 0; i < EEPROM.length(); i++) {
			EEPROM.put(i, 0);
	}
#endif
		display.clearDisplay();
		showActionPromptScreen(&display, "B2 for", "dry state");
		int br = readButton();
		while (!(br > BUTTON_2_LOW && br < BUTTON_2_HIGH)) {
			br = readButton();
		}
		display.clearDisplay();
		showTextCaptionScreen(&display, MS_READING_PROMPT_TEXT);

		// waiting for completely wet values
		extractMedianPinValueForProperty(1000, &state.s[MS_SENSOR_NEAR].dry, &state.s[MS_SENSOR_MID].dry, &state.s[MS_SENSOR_FAR].dry);
#ifdef ARDUINO_ARCH_ESP32
		preferences.putInt(MS_NEAR_DRY_SETTING_KEY, state.s[MS_SENSOR_NEAR].dry);
		preferences.putInt(MS_MID_DRY_SETTING_KEY, state.s[MS_SENSOR_MID].dry);
		preferences.putInt(MS_FAR_DRY_SETTING_KEY, state.s[MS_SENSOR_FAR].dry);
#else
		EEPROM.put(0, state.s[MS_SENSOR_NEAR].dry);
		EEPROM.put(sizeof(int), state.s[MS_SENSOR_MID].dry);
		EEPROM.put(sizeof(int) * 2, state.s[MS_SENSOR_FAR].dry);
#endif

